---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoVisibleRebarHandle
source: html/b2ac420c-c41e-ec2b-14e3-a3beefc10344.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.NoVisibleRebarHandle Property

Editing of the constraints for the selected rebar with free form geometry is not available. However, the default automatic constraints may still work.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoVisibleRebarHandle { get; }
```